qmk/qmk_firmware/tmk_core/tool/mbed/mbed-sdk/libraries/mbed/targets/cmsis/TARGET_STM/TARGET_STM32L0/TARGET_NUCLEO_L073RZ/stm32l073xx.h
/******************  Bit definition for EXTI_PR register  *********************/
#define EXTI_PR_PR0                         ((uint32_t)0x00000001)        /*!< Pending bit 0  */
#define EXTI_PR_PR1                         ((uint32_t)0x00000002)        /*!< Pending bit 1  */
#define EXTI_PR_PR2                         ((uint32_t)0x00000004)        /*!< Pending bit 2  */
#define EXTI_PR_PR3                         ((uint32_t)0x00000008)        /*!< Pending bit 3  */
#define EXTI_PR_PR4                         ((uint32_t)0x00000010)        /*!< Pending bit 4  */
#define EXTI_PR_PR5                         ((uint32_t)0x00000020)        /*!< Pending bit 5  */
#define EXTI_PR_PR6                         ((uint32_t)0x00000040)        /*!< Pending bit 6  */
#define EXTI_PR_PR7                         ((uint32_t)0x00000080)        /*!< Pending bit 7  */
#define EXTI_PR_PR8                         ((uint32_t)0x00000100)        /*!< Pending bit 8  */
#define EXTI_PR_PR9                         ((uint32_t)0x00000200)        /*!< Pending bit 9  */
#define EXTI_PR_PR10                        ((uint32_t)0x00000400)        /*!< Pending bit 10 */
#define EXTI_PR_PR11                        ((uint32_t)0x00000800)        /*!< Pending bit 11 */
#define EXTI_PR_PR12                        ((uint32_t)0x00001000)        /*!< Pending bit 12 */
#define EXTI_PR_PR13                        ((uint32_t)0x00002000)        /*!< Pending bit 13 */
#define EXTI_PR_PR14                        ((uint32_t)0x00004000)        /*!< Pending bit 14 */
#define EXTI_PR_PR15                        ((uint32_t)0x00008000)        /*!< Pending bit 15 */
#define EXTI_PR_PR16                        ((uint32_t)0x00010000)        /*!< Pending bit 16 */
#define EXTI_PR_PR17                        ((uint32_t)0x00020000)        /*!< Pending bit 17 */
#define EXTI_PR_PR19                        ((uint32_t)0x00080000)        /*!< Pending bit 19 */
#define EXTI_PR_PR20                        ((uint32_t)0x00100000)        /*!< Pending bit 20 */
#define EXTI_PR_PR21                        ((uint32_t)0x00200000)        /*!< Pending bit 21 */
#define EXTI_PR_PR22                        ((uint32_t)0x00400000)        /*!< Pending bit 22 */

/******************************************************************************/
/*                                                                            */
/*                      FLASH and Option Bytes Registers                      */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for FLASH_ACR register  ******************/
#define FLASH_ACR_LATENCY                   ((uint32_t)0x00000001)        /*!< LATENCY bit (Latency) */
#define FLASH_ACR_PRFTEN                    ((uint32_t)0x00000002)        /*!< Prefetch Buffer Enable */
#define FLASH_ACR_SLEEP_PD                  ((uint32_t)0x00000008)        /*!< Flash mode during sleep mode */
#define FLASH_ACR_RUN_PD                    ((uint32_t)0x00000010)        /*!< Flash mode during RUN mode */
#define FLASH_ACR_DISAB_BUF                 ((uint32_t)0x00000020)        /*!< Disable Buffer */
#define FLASH_ACR_PRE_READ                  ((uint32_t)0x00000040)        /*!< Pre-read data address */

/*******************  Bit definition for FLASH_PECR register  ******************/
#define FLASH_PECR_PELOCK                    ((uint32_t)0x00000001)        /*!< FLASH_PECR and Flash data Lock */
#define FLASH_PECR_PRGLOCK                   ((uint32_t)0x00000002)        /*!< Program matrix Lock */
#define FLASH_PECR_OPTLOCK                   ((uint32_t)0x00000004)        /*!< Option byte matrix Lock */
#define FLASH_PECR_PROG                      ((uint32_t)0x00000008)        /*!< Program matrix selection */
#define FLASH_PECR_DATA                      ((uint32_t)0x00000010)        /*!< Data matrix selection */
#define FLASH_PECR_FIX                       ((uint32_t)0x00000100)        /*!< Fixed Time Data write for Word/Half Word/Byte programming */
#define FLASH_PECR_ERASE                     ((uint32_t)0x00000200)        /*!< Page erasing mode */
#define FLASH_PECR_FPRG                      ((uint32_t)0x00000400)        /*!< Fast Page/Half Page programming mode */
#define FLASH_PECR_PARALLBANK                ((uint32_t)0x00008000)        /*!< Parallel Bank mode */
#define FLASH_PECR_EOPIE                     ((uint32_t)0x00010000)        /*!< End of programming interrupt */ 
#define FLASH_PECR_ERRIE                     ((uint32_t)0x00020000)        /*!< Error interrupt */ 
#define FLASH_PECR_OBL_LAUNCH                ((uint32_t)0x00040000)        /*!< Launch the option byte loading */
#define FLASH_PECR_HALF_ARRAY                ((uint32_t)0x00080000)        /*!< Half array mode */
#define FLASH_PECR_NZDISABLE                 ((uint32_t)0x00400000)        /*!< Non-Zero check disable */

/******************  Bit definition for FLASH_PDKEYR register  ******************/
#define FLASH_PDKEYR_PDKEYR                 ((uint32_t)0xFFFFFFFF)       /*!< FLASH_PEC and data matrix Key */

/******************  Bit definition for FLASH_PEKEYR register  ******************/
#define FLASH_PEKEYR_PEKEYR                 ((uint32_t)0xFFFFFFFF)       /*!< FLASH_PEC and data matrix Key */

/******************  Bit definition for FLASH_PRGKEYR register  ******************/
#define FLASH_PRGKEYR_PRGKEYR               ((uint32_t)0xFFFFFFFF)        /*!< Program matrix Key */

/******************  Bit definition for FLASH_OPTKEYR register  ******************/
#define FLASH_OPTKEYR_OPTKEYR               ((uint32_t)0xFFFFFFFF)        /*!< Option bytes matrix Key */

/******************  Bit definition for FLASH_SR register  *******************/
#define FLASH_SR_BSY                        ((uint32_t)0x00000001)        /*!< Busy */
#define FLASH_SR_EOP                        ((uint32_t)0x00000002)        /*!< End Of Programming*/
#define FLASH_SR_HVOFF                      ((uint32_t)0x00000004)        /*!< End of high voltage */
#define FLASH_SR_READY                      ((uint32_t)0x00000008)        /*!< Flash ready after low power mode */

#define FLASH_SR_WRPERR                     ((uint32_t)0x00000100)        /*!< Write protection error */
#define FLASH_SR_PGAERR                     ((uint32_t)0x00000200)        /*!< Programming Alignment Error */
#define FLASH_SR_SIZERR                     ((uint32_t)0x00000400)        /*!< Size error */
#define FLASH_SR_OPTVERR                    ((uint32_t)0x00000800)        /*!< Option Valid error */
#define FLASH_SR_RDERR                      ((uint32_t)0x00002000)        /*!< Read protected error */
#define FLASH_SR_NOTZEROERR                 ((uint32_t)0x00010000)        /*!< Not Zero error */
#define FLASH_SR_FWWERR                     ((uint32_t)0x00020000)        /*!< Write/Errase operation aborted */

/* alias maintained for legacy */
#define FLASH_SR_FWWER                      FLASH_SR_FWWERR
#define FLASH_SR_ENHV                       FLASH_SR_HVOFF
#define FLASH_SR_ENDHV                      FLASH_SR_HVOFF

/******************  Bit definition for FLASH_OPTR register  *******************/
#define FLASH_OPTR_RDPROT                   ((uint32_t)0x000000FF)        /*!< Read Protection */
#define FLASH_OPTR_WPRMOD                   ((uint32_t)0x00000100)        /*!< Selection of protection mode of WPR bits */
#define FLASH_OPTR_BOR_LEV                  ((uint32_t)0x000F0000)        /*!< BOR_LEV[3:0] Brown Out Reset Threshold Level*/
#define FLASH_OPTR_IWDG_SW                  ((uint32_t)0x00100000)        /*!< IWDG_SW */
#define FLASH_OPTR_nRST_STOP                ((uint32_t)0x00200000)        /*!< nRST_STOP */
#define FLASH_OPTR_nRST_STDBY               ((uint32_t)0x00400000)        /*!< nRST_STDBY */
#define FLASH_OPTR_BFB2                     ((uint32_t)0x00800000)        /*!< BFB2 */
#define FLASH_OPTR_USER                     ((uint32_t)0x00700000)        /*!< User Option Bytes */
#define FLASH_OPTR_BOOT1                    ((uint32_t)0x80000000)        /*!< BOOT1 */

/******************  Bit definition for FLASH_WRPR register  ******************/
#define FLASH_WRPR_WRP                      ((uint32_t)0x0000FFFF)        /*!< Write Protection bits */

/******************************************************************************/
/*                                                                            */
/*                       General Purpose IOs (GPIO)                           */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for GPIO_MODER register  *****************/
#define GPIO_MODER_MODE0          ((uint32_t)0x00000003)
#define GPIO_MODER_MODE0_0        ((uint32_t)0x00000001)
#define GPIO_MODER_MODE0_1        ((uint32_t)0x00000002)
#define GPIO_MODER_MODE1          ((uint32_t)0x0000000C)
#define GPIO_MODER_MODE1_0        ((uint32_t)0x00000004)
#define GPIO_MODER_MODE1_1        ((uint32_t)0x00000008)
#define GPIO_MODER_MODE2          ((uint32_t)0x00000030)
#define GPIO_MODER_MODE2_0        ((uint32_t)0x00000010)
#define GPIO_MODER_MODE2_1        ((uint32_t)0x00000020)
#define GPIO_MODER_MODE3          ((uint32_t)0x000000C0)
#define GPIO_MODER_MODE3_0        ((uint32_t)0x00000040)
#define GPIO_MODER_MODE3_1        ((uint32_t)0x00000080)
#define GPIO_MODER_MODE4          ((uint32_t)0x00000300)
#define GPIO_MODER_MODE4_0        ((uint32_t)0x00000100)
#define GPIO_MODER_MODE4_1        ((uint32_t)0x00000200)
#define GPIO_MODER_MODE5          ((uint32_t)0x00000C00)
#define GPIO_MODER_MODE5_0        ((uint32_t)0x00000400)
#define GPIO_MODER_MODE5_1        ((uint32_t)0x00000800)
#define GPIO_MODER_MODE6          ((uint32_t)0x00003000)
#define GPIO_MODER_MODE6_0        ((uint32_t)0x00001000)
#define GPIO_MODER_MODE6_1        ((uint32_t)0x00002000)
#define GPIO_MODER_MODE7          ((uint32_t)0x0000C000)
#define GPIO_MODER_MODE7_0        ((uint32_t)0x00004000)
#define GPIO_MODER_MODE7_1        ((uint32_t)0x00008000)
#define GPIO_MODER_MODE8          ((uint32_t)0x00030000)
#define GPIO_MODER_MODE8_0        ((uint32_t)0x00010000)
#define GPIO_MODER_MODE8_1        ((uint32_t)0x00020000)
#define GPIO_MODER_MODE9          ((uint32_t)0x000C0000)
#define GPIO_MODER_MODE9_0        ((uint32_t)0x00040000)
#define GPIO_MODER_MODE9_1        ((uint32_t)0x00080000)
#define GPIO_MODER_MODE10         ((uint32_t)0x00300000)
#define GPIO_MODER_MODE10_0       ((uint32_t)0x00100000)
#define GPIO_MODER_MODE10_1       ((uint32_t)0x00200000)
#define GPIO_MODER_MODE11         ((uint32_t)0x00C00000)
#define GPIO_MODER_MODE11_0       ((uint32_t)0x00400000)
#define GPIO_MODER_MODE11_1       ((uint32_t)0x00800000)
#define GPIO_MODER_MODE12         ((uint32_t)0x03000000)
#define GPIO_MODER_MODE12_0       ((uint32_t)0x01000000)
#define GPIO_MODER_MODE12_1       ((uint32_t)0x02000000)
#define GPIO_MODER_MODE13         ((uint32_t)0x0C000000)
#define GPIO_MODER_MODE13_0       ((uint32_t)0x04000000)
#define GPIO_MODER_MODE13_1       ((uint32_t)0x08000000)
#define GPIO_MODER_MODE14         ((uint32_t)0x30000000)
#define GPIO_MODER_MODE14_0       ((uint32_t)0x10000000)
#define GPIO_MODER_MODE14_1       ((uint32_t)0x20000000)
#define GPIO_MODER_MODE15         ((uint32_t)0xC0000000)
#define GPIO_MODER_MODE15_0       ((uint32_t)0x40000000)
#define GPIO_MODER_MODE15_1       ((uint32_t)0x80000000)

