qmk/qmk_firmware/tmk_core/tool/mbed/mbed-sdk/libraries/mbed/targets/cmsis/TARGET_STM/TARGET_STM32L0/TARGET_NUCLEO_L073RZ/stm32l073xx.h
/*!< I2C3 Clock source selection */
#define RCC_CCIPR_I2C3SEL                   ((uint32_t)0x00030000)        /*!< I2C3SEL [1:0] bits */
#define RCC_CCIPR_I2C3SEL_0                 ((uint32_t)0x00010000)        /*!< Bit 0 */
#define RCC_CCIPR_I2C3SEL_1                 ((uint32_t)0x00020000)        /*!< Bit 1 */

/*!< LPTIM1 Clock source selection */ 
#define RCC_CCIPR_LPTIM1SEL                 ((uint32_t)0x000C0000)        /*!< LPTIM1SEL [1:0] bits */
#define RCC_CCIPR_LPTIM1SEL_0               ((uint32_t)0x00040000)        /*!< Bit 0 */
#define RCC_CCIPR_LPTIM1SEL_1               ((uint32_t)0x00080000)        /*!< Bit 1 */

/*!< HSI48 Clock source selection */ 
#define RCC_CCIPR_HSI48SEL                  ((uint32_t)0x04000000)        /*!< HSI48 RC clock source selection bit for USB and RNG*/

/* Bit name alias maintained for legacy */
#define RCC_CCIPR_HSI48MSEL                 RCC_CCIPR_HSI48SEL

/*******************  Bit definition for RCC_CSR register  *******************/
#define RCC_CSR_LSION                       ((uint32_t)0x00000001)        /*!< Internal Low Speed oscillator enable */
#define RCC_CSR_LSIRDY                      ((uint32_t)0x00000002)        /*!< Internal Low Speed oscillator Ready */

#define RCC_CSR_LSEON                       ((uint32_t)0x00000100)        /*!< External Low Speed oscillator enable */
#define RCC_CSR_LSERDY                      ((uint32_t)0x00000200)        /*!< External Low Speed oscillator Ready */
#define RCC_CSR_LSEBYP                      ((uint32_t)0x00000400)        /*!< External Low Speed oscillator Bypass */
                                             
#define RCC_CSR_LSEDRV                      ((uint32_t)0x00001800)        /*!< LSEDRV[1:0] bits (LSE Osc. drive capability) */
#define RCC_CSR_LSEDRV_0                    ((uint32_t)0x00000800)        /*!< Bit 0 */
#define RCC_CSR_LSEDRV_1                    ((uint32_t)0x00001000)        /*!< Bit 1 */
                                             
#define RCC_CSR_LSECSSON                    ((uint32_t)0x00002000)        /*!< External Low Speed oscillator CSS Enable */
#define RCC_CSR_LSECSSD                     ((uint32_t)0x00004000)        /*!< External Low Speed oscillator CSS Detected */
                                             
/*!< RTC congiguration */                    
#define RCC_CSR_RTCSEL                      ((uint32_t)0x00030000)        /*!< RTCSEL[1:0] bits (RTC clock source selection) */
#define RCC_CSR_RTCSEL_0                    ((uint32_t)0x00010000)        /*!< Bit 0 */
#define RCC_CSR_RTCSEL_1                    ((uint32_t)0x00020000)        /*!< Bit 1 */
                                             
#define RCC_CSR_RTCSEL_NOCLOCK              ((uint32_t)0x00000000)        /*!< No clock */
#define RCC_CSR_RTCSEL_LSE                  ((uint32_t)0x00010000)        /*!< LSE oscillator clock used as RTC clock */
#define RCC_CSR_RTCSEL_LSI                  ((uint32_t)0x00020000)        /*!< LSI oscillator clock used as RTC clock */
#define RCC_CSR_RTCSEL_HSE                  ((uint32_t)0x00030000)        /*!< HSE oscillator clock used as RTC clock */
                                             
#define RCC_CSR_RTCEN                       ((uint32_t)0x00040000)        /*!< RTC clock enable */
#define RCC_CSR_RTCRST                      ((uint32_t)0x00080000)        /*!< RTC software reset  */

#define RCC_CSR_RMVF                        ((uint32_t)0x00800000)        /*!< Remove reset flag */
#define RCC_CSR_FWRSTF                      ((uint32_t)0x01000000)        /*!< Mifare Firewall reset flag */
#define RCC_CSR_OBL                         ((uint32_t)0x02000000)        /*!< OBL reset flag */
#define RCC_CSR_PINRSTF                     ((uint32_t)0x04000000)        /*!< PIN reset flag */
#define RCC_CSR_PORRSTF                     ((uint32_t)0x08000000)        /*!< POR/PDR reset flag */
#define RCC_CSR_SFTRSTF                     ((uint32_t)0x10000000)        /*!< Software Reset flag */
#define RCC_CSR_IWDGRSTF                    ((uint32_t)0x20000000)        /*!< Independent Watchdog reset flag */
#define RCC_CSR_WWDGRSTF                    ((uint32_t)0x40000000)        /*!< Window watchdog reset flag */
#define RCC_CSR_LPWRRSTF                    ((uint32_t)0x80000000)        /*!< Low-Power reset flag */

/******************************************************************************/
/*                                                                            */
/*                                    RNG                                     */
/*                                                                            */
/******************************************************************************/
/********************  Bits definition for RNG_CR register  *******************/
#define RNG_CR_RNGEN                         ((uint32_t)0x00000004)
#define RNG_CR_IE                            ((uint32_t)0x00000008)

/********************  Bits definition for RNG_SR register  *******************/
#define RNG_SR_DRDY                          ((uint32_t)0x00000001)
#define RNG_SR_CECS                          ((uint32_t)0x00000002)
#define RNG_SR_SECS                          ((uint32_t)0x00000004)
#define RNG_SR_CEIS                          ((uint32_t)0x00000020)
#define RNG_SR_SEIS                          ((uint32_t)0x00000040)

/******************************************************************************/
/*                                                                            */
/*                           Real-Time Clock (RTC)                            */
/*                                                                            */
/******************************************************************************/
/********************  Bits definition for RTC_TR register  *******************/
#define RTC_TR_PM                            ((uint32_t)0x00400000)        /*!<  */
#define RTC_TR_HT                            ((uint32_t)0x00300000)        /*!<  */
#define RTC_TR_HT_0                          ((uint32_t)0x00100000)        /*!<  */
#define RTC_TR_HT_1                          ((uint32_t)0x00200000)        /*!<  */
#define RTC_TR_HU                            ((uint32_t)0x000F0000)        /*!<  */
#define RTC_TR_HU_0                          ((uint32_t)0x00010000)        /*!<  */
#define RTC_TR_HU_1                          ((uint32_t)0x00020000)        /*!<  */
#define RTC_TR_HU_2                          ((uint32_t)0x00040000)        /*!<  */
#define RTC_TR_HU_3                          ((uint32_t)0x00080000)        /*!<  */
#define RTC_TR_MNT                           ((uint32_t)0x00007000)        /*!<  */
#define RTC_TR_MNT_0                         ((uint32_t)0x00001000)        /*!<  */
#define RTC_TR_MNT_1                         ((uint32_t)0x00002000)        /*!<  */
#define RTC_TR_MNT_2                         ((uint32_t)0x00004000)        /*!<  */
#define RTC_TR_MNU                           ((uint32_t)0x00000F00)        /*!<  */
#define RTC_TR_MNU_0                         ((uint32_t)0x00000100)        /*!<  */
#define RTC_TR_MNU_1                         ((uint32_t)0x00000200)        /*!<  */
#define RTC_TR_MNU_2                         ((uint32_t)0x00000400)        /*!<  */
#define RTC_TR_MNU_3                         ((uint32_t)0x00000800)        /*!<  */
#define RTC_TR_ST                            ((uint32_t)0x00000070)        /*!<  */
#define RTC_TR_ST_0                          ((uint32_t)0x00000010)        /*!<  */
#define RTC_TR_ST_1                          ((uint32_t)0x00000020)        /*!<  */
#define RTC_TR_ST_2                          ((uint32_t)0x00000040)        /*!<  */
#define RTC_TR_SU                            ((uint32_t)0x0000000F)        /*!<  */
#define RTC_TR_SU_0                          ((uint32_t)0x00000001)        /*!<  */
#define RTC_TR_SU_1                          ((uint32_t)0x00000002)        /*!<  */
#define RTC_TR_SU_2                          ((uint32_t)0x00000004)        /*!<  */
#define RTC_TR_SU_3                          ((uint32_t)0x00000008)        /*!<  */

